#include "utimer.h"


u32 InPut_FrontTime = 0; //²¶»ñÉÏÒ»´ÎÂö³åÎ¶ÔÓ¦µÄÊ±¼ä
u32 InPut_CurrentTime  = 0;//²¶»ñµ±Ç°Âö³å¶ÔÓ¦µÄÊ±¼ä
u32 InPut_PulseTime = 0;//²¶»ñÂö³åÖÜÆÚÖµ

/*******************************************************************************
 º¯ÊıÃû³Æ£º    int InPut_Time(void)
 ¹¦ÄÜÃèÊö£º    TIMER0ÖĞ¶Ï´¦Àíº¯Êı
 ÊäÈë²ÎÊı£º    ÎŞ
 Êä³ö²ÎÊı£º    ÎŞ
 ·µ »Ø Öµ£º    InPut_PulseTime:²¶»ñÂö³åÖÜÆÚÖµ(µ¥Î»ºÁÃë)
 ÆäËüËµÃ÷£º
 ĞŞ¸ÄÈÕÆÚ      °æ±¾ºÅ          ĞŞ¸ÄÈË            ĞŞ¸ÄÄÚÈİ
 -----------------------------------------------------------------------------
 2021/2/25      V1.0                               ´´½¨
 *******************************************************************************/
int InPut_Time(void)
{
   return InPut_PulseTime;
}	




