/*******************************************************************************
 * 版权所有 (C)2015, LINKO SEMICONDUCTOR Co.ltd
 *
 * 文件名称： interrupt.c
 * 文件标识：
 * 内容摘要： 中断服务程序文件
 * 其它说明： 无
 * 当前版本： V 1.0
 * 作    者： Howlet
 * 完成日期： 2015年11月5日
 *
 * 修改记录1：
 * 修改日期：2015年11月5日
 * 版 本 号：V 1.0
 * 修 改 人：Howlet
 * 修改内容：创建
 *
 * 修改记录2：
 * 修改日期： 2021年8月27日
 * 版 本 号： V 1.0
 * 修 改 人： HMG
 * 修改内容： 创建
 *
 *******************************************************************************/
#include "hardware_config.h"
#include "gpio_led.h"
#include "utimer.h"
/*******************************************************************************
 函数名称：    void ADC0_IRQHandler(void)
 功能描述：    ADC0中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
float Voltage_Value;
int Voltage0_Value0 = 0;
int Voltage0_Value1 = 0;
int Voltage1_Value0 = 0;
int Voltage1_Value1 = 0;
void ADC0_IRQHandler(void)
{
	 Voltage0_Value1 = ADC0_DAT1;
	 Voltage1_Value0 = ADC0_DAT2;
 	 Voltage1_Value1 = ADC0_DAT3;
	if(ADC0_IF & BIT0)//判断是否发生第一采样完成中断
	{
	   ADC0_IF = BIT0; //清除第一段采样完成中断标志位
		 
		  if(!((ADC0_DAT0 >> 4) & BIT11))//判断是否是正电压
	{
		   Voltage0_Value0 = ADC0_DAT0;
		  
		   Voltage_Value = (((ADC0_DAT0>>4)*3.6)/2047);
		
	}else Voltage_Value = (-(~ADC0_DAT0 >> 4)*3.6/2047);
	}
	ADC0_IF = BIT1;//清除第2段采样完成中断标志位、
	
	if(ADC0_IF & BIT6)
	{
    ADC0_IF = BIT6; //清除ADC0_DAT0超阈值中断
		LED2_ON;
	}else LED2_OFF;
}

/*******************************************************************************
 函数名称：    void UART0_IRQHandler(void)
 功能描述：    UART0中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void UART0_IRQHandler(void)
{
	if (UART0_IF & UART_IF_SendOver)
	{
		UART0_IF |= UART_IF_SendOver;
	}
	if (UART0_IF & UART_IF_RcvOver)
	{
		UART0_IF |= UART_IF_RcvOver;
	}
}
/*******************************************************************************
 函数名称：    void MCPWM_IRQHandler(void)
 功能描述：    MCPWM中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void MCPWM_IRQHandler(void)
{

	MCPWM_IF = BIT1 | BIT0;
}

/*******************************************************************************
 函数名称：    void HALL_IRQHandler(void)
 功能描述：    HALL中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void HALL_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void TIMER0_IRQHandler(void)
 功能描述：    TIMER0中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void UTIMER0_IRQHandler(void)
{

	static int Timer_flag = 0 , Timer_flag1 = 0 ;
	static u8 Input_Flag = 0;//捕获一个脉冲第一个上升沿标志位
	if(UTIMER_IF& Timer_IRQEna_Zero)//判断UTimer0是否发生过零中断
	{//中断进入一次为0.5ms
//    TIM_ClearIRQFlag(BIT1);//清除UTimer0中断过零标志位
//	  UTIMER_IF |= TIMER_IF_CH0; //清除UTimer中断标志
	  UTIMER_IF = Timer_IRQEna_Zero; //清除UTimer中断标志位  
    Timer_flag++;
		if(Timer_flag==1000)
			{
				 Timer_flag=0;
//			   Invers_GPIO(GPIO0,GPIO_Pin_6);//LED1反转
			}		

			OverFlow += 1;		
	}
	
	if(UTIMER_IF&Timer_IRQEna_CH0)//判断UTimer0的CH0是否发生捕下降沿中断TIM0_CH0: P0.15
	{
	  UTIMER_IF = Timer_IRQEna_CH0; //清除UTimer中断标志位  
    Timer_flag1++;
		if(Timer_flag1==5)
			{
				 Timer_flag1=0;
				 Invers_GPIO(GPIO0,GPIO_Pin_3);//LED3反转
				 
			}
	 }
	if(UTIMER_IF&Timer_IRQEna_CH1)//判断UTimer0的CH1是否发生捕获上升沿中断 TIM0_CH1: P0.14
	{
	  UTIMER_IF = Timer_IRQEna_CH1; //清除UTimer中断标志位
		Input_Flag += 1;
		if(Input_Flag == 2)
		{
			 InPut_CurrentTime = UTIMER_UNT0_CMP0;
			if(OverFlow != 0)
			{
		    InPut_PulseTime = ((OverFlow-1)*48000+48000-InPut_FrontTime+InPut_CurrentTime)/96000;//单个脉冲的周期值(单位毫秒)		  
			}else InPut_PulseTime = InPut_CurrentTime - InPut_FrontTime;//单个脉冲的周期值(单位毫秒)
			Input_Flag = 1;
		}
		
		if(Input_Flag == 1)//第一个上升沿标志位
		{
			InPut_FrontTime = UTIMER_UNT0_CMP0;
		  OverFlow = 0;//清除捕获计数器溢出次数
		}			
	}

}

/*******************************************************************************
 函数名称：    void TIMER1_IRQHandler(void)
 功能描述：    TIMER1中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void UTIMER1_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void TIMER2_IRQHandler(void)
 功能描述：    TIMER2中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void UTIMER2_IRQHandler(void)
{
	if(UTIMER_IF & BIT6)//判断UTimer0是否发生过零中断
	{//中断进入一次
	  UTIMER_IF = BIT6; //清除UTimer中断标志位  
	}
  if(UTIMER_IF & BIT7)//判断UTimer0是否发生过零中断
	{//中断进入一次
	  UTIMER_IF = BIT7; //清除UTimer中断标志位  
	}
	if(UTIMER_IF & BIT8)//判断UTimer0是否发生过零中断
	{//中断进入一次
	  UTIMER_IF = BIT8; //清除UTimer中断标志位  
	}
}

/*******************************************************************************
 函数名称：    void TIMER3_IRQHandler(void)
 功能描述：    TIMER3中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void UTIMER3_IRQHandler(void)
{
  if(UTIMER_IF & BIT9)//判断UTimer3是否发生过零中断
	{//中断进入一次
	  UTIMER_IF = BIT9; //清除UTimer中断标志位  
	}
  if(UTIMER_IF & BIT10)//判断UTimer3是否发生过零中断
	{//中断进入一次
	  UTIMER_IF = BIT10; //清除UTimer中断标志位  
	}
	if(UTIMER_IF & BIT11)//判断UTimer3是否发生过零中断
	{//中断进入一次
	  UTIMER_IF = BIT11; //清除UTimer中断标志位  
	}
}
/*******************************************************************************
 函数名称：    void ENCODER0_IRQHandler(void)
 功能描述：    ENCODER1中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void ENCODER0_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void ENCODER0_IRQHandler(void)
 功能描述：    ENCODER1中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void ENCODER1_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void CMP_IRQHandler(void)
 功能描述：    比较器中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void CMP_IRQHandler(void)
{
	CMP_IF = BIT0 | BIT1;

	if (CMP_IF & (BIT1))
	{
		volatile u8 t_bi, t_bcnt;

		t_bcnt = 0;
		for (t_bi = 0; t_bi < 5; t_bi++)
		{
			if (SYS_AFE_CMP & BIT15) /* BIT14 CMP0 OUT Flag| BIT15 CMP1 OUT Flag */
			{
				t_bcnt++;
			}
		}

		if (t_bcnt > 3)
		{
			PWMOutputs(DISABLE);
			MCPWM_EIF = BIT4 | BIT5;
		}
	}
}

/*******************************************************************************
 函数名称：    void UART1_IRQHandler(void)
 功能描述：    UART1中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void UART1_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void SysTick_Handler(void)
 功能描述：    系统滴答定时中断
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void SysTick_Handler(void)
{
}

/*******************************************************************************
 函数名称：    void SleepTimer_IRQHandler(void)
 功能描述：    休眠唤醒中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void SleepTimer_IRQHandler(void)
{
	while (1)
		;
}

/*******************************************************************************
 函数名称：    void GPIO_IRQHandler(void)
 功能描述：    GPIO中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void GPIO_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void I2C0_IRQHandler(void)
 功能描述：    I2C0中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void I2C0_IRQHandler(void)
{
}

/*******************************************************************************
 函数名称：    void SPI0_IRQHandler(void)
 功能描述：    SPI0中断处理函数
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2020/8/5      V1.0           Howlet Li          创建
 *******************************************************************************/
void SPI0_IRQHandler(void)
{
}

/************************ (C) COPYRIGHT LINKO SEMICONDUCTOR **********************/
/* ------------------------------END OF FILE------------------------------------ */
